package kr.co.bitcamp.oop1;
/*
 * 다음은 클래스 작성시 주의할 사항인데 이중 틀린것을 말해보시오
 * 
 * - 통상 하나의 파일에 하나의 클래스를 사용, 상황에 따라 복수개의 클래스 사용 가능
 * 
 * (1) 하나의 파일에 2개 이상의 클래스를 작성할 수 있다.(O)
 * (2) 3개의 클래스가 있다면, 자바 파일명이 될 수 있는 것은 public 키워드가 붙은 클래스이다.(O)
 * (3) 하나의 파일에 있는 3개의 클래스에 모두 public 키워드를 붙일 수 있다.(X)
 *     => public 키워드는 하나만 가능하다.
 * (4) 한 파일 내에 3개 이상의 클래스에 모두 public 키워드를 안붙일 수 있다.(O)
 * (5) 한 파일 내 3개 이상의 클래스에 모두 public 키워드가 없다면 클래스 중 어느 것이라도 파일명이 될 수 있다.(O)
 * (6) 자바 파일에 클래스가 한 개 있다면 이 클래스명이 곧 파일명이 되어야 한다.(O)
 * 
 */

//publi class a{            --> 하나의 파일 안에 모두 public을 붙일수는 없다.
//                              public으로 선언한 키워드는 파일명이 된다.
//}

public class Oop02 {
    public static void main(String[] args) {
        
    }

}
